7767517
18 18
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=3 4=1 5=1 6=1728 9=1
Pooling                  maxpool2d_11             1 1 1 2 1=2 2=2 5=1
Convolution              convrelu_1               1 1 2 3 0=128 1=3 4=1 5=1 6=73728 9=1
Pooling                  maxpool2d_12             1 1 3 4 1=2 2=2 5=1
Convolution              convrelu_2               1 1 4 5 0=256 1=3 4=1 5=1 6=294912 9=1
Convolution              convrelu_3               1 1 5 6 0=256 1=3 4=1 5=1 6=589824 9=1
Pooling                  maxpool2d_13             1 1 6 7 1=2 12=2 3=1 13=0 5=1
Convolution              convrelu_4               1 1 7 8 0=512 1=3 4=1 5=1 6=1179648 9=1
Convolution              convrelu_5               1 1 8 9 0=512 1=3 4=1 5=1 6=2359296 9=1
Pooling                  maxpool2d_14             1 1 9 10 1=2 12=2 3=1 13=0 5=1
Convolution              convrelu_6               1 1 10 11 0=512 1=2 5=1 6=1048576 9=1
Squeeze                  squeeze_22               1 1 11 12 -23303=1,1
Permute                  transpose_23             1 1 12 13 0=1
LSTM                     lstm_9                   1 1 13 14 0=256 1=1048576 2=2 3=256
Gemm                     gemm_0                   1 1 14 15 3=1 5=1 6=1 7=33 8=256 9=512 10=4
LSTM                     lstm_10                  1 1 15 16 0=256 1=524288 2=2 3=256
Gemm                     gemm_1                   1 1 16 out0 3=1 5=1 6=1 7=33 8=95 9=512 10=4
